#### It is the most popular data analysis library for python and it comes with many tools that we will use throughout the course.

#### There is a lof of similarities between them numpy and pandas because pandas is essentially written by numpy.

#### This section we'll learn about:
##### Series and DataFrames
##### Missing Data
##### Groupby
##### Operations
##### Data I/O

# Pandas Series

#### Series is the basic building block of Pandas.
#### It holds an array of information organized by an Index

In [2]:
import numpy as np
import pandas as pd

In [3]:
labels = ['a','b','c']

In [4]:
mylist = [10,20,30]

In [6]:
pd.Series(data=mylist)

0    10
1    20
2    30
dtype: int64

In [7]:
pd.Series(data=mylist,index=labels)

a    10
b    20
c    30
dtype: int64

In [8]:
pd.Series(mylist,labels)

a    10
b    20
c    30
dtype: int64

# Data Frames

## Part 1

In [9]:
from numpy.random import randn
np.random.seed(101)

In [10]:
rand_mat = randn(5,4)

In [11]:
rand_mat

array([[ 2.70684984,  0.62813271,  0.90796945,  0.50382575],
       [ 0.65111795, -0.31931804, -0.84807698,  0.60596535],
       [-2.01816824,  0.74012206,  0.52881349, -0.58900053],
       [ 0.18869531, -0.75887206, -0.93323722,  0.95505651],
       [ 0.19079432,  1.97875732,  2.60596728,  0.68350889]])

In [12]:
df = pd.DataFrame(data=rand_mat)

In [103]:
df

               W         X         Y         Z
States
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509

In [108]:
type(df['W'])

pandas.core.series.Series

In [14]:
# As you can see above data frame consist of the series
#each columns is a series

In [15]:
df = pd.DataFrame(data=rand_mat, index='A B C D E'.split())

In [17]:
df

          0         1         2         3
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [18]:
# it is an list
index='A B C D E'.split()
index

['A', 'B', 'C', 'D', 'E']

In [42]:
df = pd.DataFrame(data=rand_mat, index='A B C D E'.split(), 
                  columns='W X Y Z'.split())

In [43]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [44]:
type(df['W'])

pandas.core.series.Series

In [45]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [116]:
mylist = ['W', 'Y']

In [117]:
df[mylist]

               W         Y
States
CA      2.706850  0.907969
NY      0.651118 -0.848077
WY     -2.018168  0.528813
OR      0.188695 -0.933237
CO      0.190794  2.605967

In [48]:
df[['W','Y']]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077
C -2.018168  0.528813
D  0.188695 -0.933237
E  0.190794  2.605967

In [49]:
# if you try to access the element does not exist:
df['NEW']

KeyError: 'NEW'

In [50]:
#add column:
df['NEW'] = randn(5)

In [51]:
df

          W         X         Y         Z       NEW
A  2.706850  0.628133  0.907969  0.503826  0.390528
B  0.651118 -0.319318 -0.848077  0.605965  0.166905
C -2.018168  0.740122  0.528813 -0.589001  0.184502
D  0.188695 -0.758872 -0.933237  0.955057  0.807706
E  0.190794  1.978757  2.605967  0.683509  0.072960

In [52]:
df.drop('NEW')

KeyError: "['NEW'] not found in axis"

In [53]:
# Its looks rows in axis = 0 as you can see above

In [54]:
#if you delete column:
df.drop('NEW',axis=1)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [55]:
#inplace is false above

In [56]:
df

          W         X         Y         Z       NEW
A  2.706850  0.628133  0.907969  0.503826  0.390528
B  0.651118 -0.319318 -0.848077  0.605965  0.166905
C -2.018168  0.740122  0.528813 -0.589001  0.184502
D  0.188695 -0.758872 -0.933237  0.955057  0.807706
E  0.190794  1.978757  2.605967  0.683509  0.072960

In [57]:
df.drop('NEW',axis=1,inplace=True)

In [58]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [59]:
df.drop('C')

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [60]:
#Satırlara ulaşmak icin
df.loc['A']

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [61]:
df.iloc[0]

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [62]:
df.loc[['A','E']]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
E  0.190794  1.978757  2.605967  0.683509

In [63]:
df.loc[['A','B']][['Y','Z']]

          Y         Z
A  0.907969  0.503826
B -0.848077  0.605965

## Logical Operations Comparisions

In [65]:
df > 0

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [66]:
type(df>0)

pandas.core.frame.DataFrame

In [67]:
df_bool = df>0

In [68]:
df_bool

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [69]:
df[df>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [70]:
df['W']>0

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [72]:
#W nin 0 dan küçük elemanının olduğu tüm satırı siler
df[df['W']>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [73]:
df[df['W']>0]['Y']

A    0.907969
B   -0.848077
D   -0.933237
E    2.605967
Name: Y, dtype: float64

In [74]:
df[df['W']>0]['Y'].loc['A']

0.9079694464765431

In [76]:
cond1 = df['W']>0
cond2 = df['Y']>1

In [77]:
df[cond1 and cond2]

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [78]:
df[cond1 & cond2]

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

In [79]:
df[(df['W']>0) & ( df['Y']>1)]

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

In [80]:
df.reset_index()
#bunu yeni index vermeden önce eskisini silmek icin kullanacaksın

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [81]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [82]:
new_ind = 'CA NY WY OR CO'.split()

In [83]:
df['States'] = new_ind

In [87]:
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CO

In [91]:
df.set_index('States',inplace=True)

In [92]:
df

               W         X         Y         Z
States
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509

In [93]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, CA to CO
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   W       5 non-null      float64
 1   X       5 non-null      float64
 2   Y       5 non-null      float64
 3   Z       5 non-null      float64
dtypes: float64(4)
memory usage: 200.0+ bytes

In [94]:
df.dtypes

W    float64
X    float64
Y    float64
Z    float64
dtype: object

In [95]:
df.describe()

              W         X         Y         Z
count  5.000000  5.000000  5.000000  5.000000
mean   0.343858  0.453764  0.452287  0.431871
std    1.681131  1.061385  1.454516  0.594708
min   -2.018168 -0.758872 -0.933237 -0.589001
25%    0.188695 -0.319318 -0.848077  0.503826
50%    0.190794  0.628133  0.528813  0.605965
75%    0.651118  0.740122  0.907969  0.683509
max    2.706850  1.978757  2.605967  0.955057

In [96]:
df['W']>0

States
CA     True
NY     True
WY    False
OR     True
CO     True
Name: W, dtype: bool

In [97]:
ser_w =  df['W']>0
#kac tane true false oldugunu ogrenmeye calısalım

In [99]:
ser_w.value_counts()

True     4
False    1
Name: W, dtype: int64

In [100]:
sum(ser_w)

4

In [101]:
len(ser_w)

5

In [102]:
len(ser_w)-sum(ser_w)

1

# GroupBy Operations

##### Sometimes you may want to perform an analysis based off the value of specific column, meaning you want to group together other columns based off another. 
##### In order to do this, we to perform 3 steps:
##### Split
##### Apply
##### Combine
#### Pandas does all of this for this with a simple method call: .groupby()

In [119]:
# dictionary for data
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [120]:
data

{'Company': ['GOOG', 'GOOG', 'MSFT', 'MSFT', 'FB', 'FB'],
 'Person': ['Sam', 'Charlie', 'Amy', 'Vanessa', 'Carl', 'Sarah'],
 'Sales': [200, 120, 340, 124, 243, 350]}

In [121]:
df = pd.DataFrame(data)

In [122]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [126]:
df.groupby('Company')

#### The reason that you dont see any result is because as I mentione you need to perform some sort of aggregate method or function call on this group by object.

#### Pandas is ready to split but it's waiting for you to tell it how you actually want to combine or aggregate the states together.

In [127]:
df.groupby('Company').mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [128]:
df.groupby('Company').std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [129]:
df.groupby('Company').max()

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

In [130]:
df.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [134]:
df.groupby('Company').describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

# Pandas Operations

In [139]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],
                   'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [140]:
df['col2'].unique()

array([444, 555, 666])

In [141]:
df['col2'].nunique()

3

In [143]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [144]:
# Col > 1
#Cols == 444

newdf = df[(df['col1'] > 2) & (df['col2']==444)]

In [145]:
newdf

   col1  col2 col3
3     4   444  xyz

#### You can create a function an then apply it to any column and see what the results are.

In [146]:
def times_two(number):
    return number*2

In [147]:
df['col1'].apply(times_two)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [149]:
df['new'] = df['col1'].apply(times_two)

In [150]:
df

   col1  col2 col3  new
0     1   444  abc    2
1     2   555  def    4
2     3   666  ghi    6
3     4   444  xyz    8

#### If you want permanently delete the column:

In [151]:
del df['new']

In [152]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [153]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [155]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   col1    4 non-null      int64
 1   col2    4 non-null      int64
 2   col3    4 non-null      object
dtypes: int64(2), object(1)
memory usage: 224.0+ bytes

In [156]:
df.describe()

           col1        col2
count  4.000000    4.000000
mean   2.500000  527.250000
std    1.290994  106.274409
min    1.000000  444.000000
25%    1.750000  444.000000
50%    2.500000  499.500000
75%    3.250000  582.750000
max    4.000000  666.000000

#### Sort your data frame:

In [157]:
df.sort_values(by='col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [158]:
df.sort_values(by='col2', ascending=False)

   col1  col2 col3
2     3   666  ghi
1     2   555  def
0     1   444  abc
3     4   444  xyz